#### Terraform Plan 📖 (apply) env/common/s3 `success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mmodule.s3_bucket.aws_s3_bucket.example: Refreshing state... [id=wnt-example-bucket-dev3][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
[31m-[0m/[32m+[0m destroy and then create replacement[0m

Terraform will perform the following actions:

[1m  # module.s3_bucket.aws_s3_bucket.example[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_s3_bucket" "example" {
      [32m+[0m[0m acceleration_status         = (known after apply)
      [32m+[0m[0m acl                         = (known after apply)
      [33m~[0m[0m arn                         = "arn:aws:s3:::wnt-example-bucket-dev3" -> (known after apply)
      [33m~[0m[0m bucket                      = "wnt-example-bucket-dev3" [33m->[0m[0m "wnt-example-bucket-dev4" [31m# forces replacement[0m[0m
      [33m~[0m[0m bucket_domain_name          = "wnt-example-bucket-dev3.s3.amazonaws.com" -> (known after apply)
      [32m+[0m[0m bucket_prefix               = (known after apply)
      [33m~[0m[0m bucket_regional_domain_name = "wnt-example-bucket-dev3.s3.ap-northeast-1.amazonaws.com" -> (known after apply)
      [33m~[0m[0m hosted_zone_id              = "Z2M4EHUR26P7ZW" -> (known after apply)
      [33m~[0m[0m id                          = "wnt-example-bucket-dev3" -> (known after apply)
      [33m~[0m[0m object_lock_enabled         = false -> (known after apply)
      [32m+[0m[0m policy                      = (known after apply)
      [33m~[0m[0m region                      = "ap-northeast-1" -> (known after apply)
      [33m~[0m[0m request_payer               = "BucketOwner" -> (known after apply)
      [31m-[0m[0m tags                        = {} [90m-> null[0m[0m
      [32m+[0m[0m website_domain              = (known after apply)
      [32m+[0m[0m website_endpoint            = (known after apply)
        [90m# (2 unchanged attributes hidden)[0m[0m

      [31m-[0m[0m grant {
          [31m-[0m[0m id          = "b1bfb669dd11570bc3cd1ac5fd8dd062ef58f06e5e30464d5a6df5ed15ed7602" [90m-> null[0m[0m
          [31m-[0m[0m permissions = [
              [31m-[0m[0m "FULL_CONTROL",
            ] [90m-> null[0m[0m
          [31m-[0m[0m type        = "CanonicalUser" [90m-> null[0m[0m
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [31m-[0m[0m server_side_encryption_configuration {
          [31m-[0m[0m rule {
              [31m-[0m[0m bucket_key_enabled = false [90m-> null[0m[0m

              [31m-[0m[0m apply_server_side_encryption_by_default {
                  [31m-[0m[0m sse_algorithm     = "AES256" [90m-> null[0m[0m
                    [90m# (1 unchanged attribute hidden)[0m[0m
                }
            }
        }

      [31m-[0m[0m versioning {
          [31m-[0m[0m enabled    = false [90m-> null[0m[0m
          [31m-[0m[0m mfa_delete = false [90m-> null[0m[0m
        }
    }

[1mPlan:[0m 1 to add, 0 to change, 1 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @NishimuraTakuya-nt, Action: `pull_request`*